app/Controllers/AuthController.php

INSERT INTO `usuarios` (`username`, `email`, `password`) VALUES ('adriano', 'adriano@gmail.com', '$2y$10$goucoLDsDYtqdfNkBIqwDuv/bqd95hMjW6FuM0veTsWvk15bBjrfC')
---
    public function realizarCadastro()
    {

        $novoUsuario = new UserModel();

        $data = [
                'username' => $this->request->getPost('username'),
                'email' => $this->request->getPost('email'),
                //'password' => $this->request->getPost('password')
                'password' => password_hash($this->request->getPost('password'), PASSWORD_BCRYPT),

            ];

            var_dump($data);

        if($novoUsuario->save($data)){